SocketServer/test/artillery.yml
# socket.io로 30초 동안 테스트를 진행합니다.
# 
config:
#  target: "http://54.175.217.96:9014"     # 테스트가 진행될 주소
#  target: "https://dna.soyoungpark.me:9014"
  target: "http://localhost:9014"
#  socketio:                           # socket.io로 테스트한다는 뜻
#    transports: ["websocket"]
  phases:                             # 해당 기간 동안 몇 명의 가상 유저가 생성되는지
    - duration: 10                    # 테스트가 진행되는 시간 (초 단위)
      arrivalRate: 1000               # 매 초 생성되는 가상 유저의 수
        
scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "save_msg"
          data: { 
            "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZHgiOjMsImlkIjoiMzQ1N3Nvc28iLCJuaWNrbmFtZSI6IuuwleyGjOyYgSIsImF2YXRhciI6Imh0dHA6Ly9wb3N0LnBoaW5mLm5hdmVyLm5ldC9NakF4TnpFeE1EWmZNakUzL01EQXhOVEE1T1RBek16RXhPVEUwLmhXcVN1bTNsdmNWLWMtdnQ0ZFMwWEJLdHcwS21VajBvSGF5VGQ4cGpNcGNnLnVXaDg2QzN0R2x2d05uUDJKaDhObzB4RjlETlhva0dIM0FHZEZnQlhfU0FnLkpQRUcvSXl0UWlfUV81YWt2ejF6SkJEWFlyVmNIUUxOZy5qcGciLCJpYXQiOjE1NDIwMzExMjUsImV4cCI6MTU0MjA3NDMyNX0.akXSp2BZ_QbeMHy73Kpkr1sTy6uuFMU0jT7bgsPS-Vo", 
            "messageData": {
              "lng": 127.101768,
              "lat": 37.590039,
              "contents": "testing",
              "type": "Message"
            },
            "radius": 1000,
            "testing": true
          }
      - think: 1